Documents/ЛБ_БланкиЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_БланкиЗалоговыхБилетов</Name>
			<Comment>Оприходование бланков залоговых билетов</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_БланкиЗалоговыхБилетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаБланковОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БланкиБилетов</Name>
					<Comment>Бланки билетов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_БланкиЗалоговыхБилетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		
		//ЛБ_УправлениеЛомбардом.ЗаполнитьШапкуДокумента(Объект, Пользователи.ТекущийПользователь());
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		Объект.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;   
		Объект.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;


	КонецЕсли;
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		

	//// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаВажныеКоманды);
	//// Конец СтандартныеПодсистемы.Печать

	//// ДополнительныеОтчетыИОбработки
	//ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	//// Конец ДополнительныеОтчетыИОбработки

	ДлинаНомера      = 10;
	СимволДополнения = "0";
	
		
	УстановитьСостояниеДокумента();
	//УстановитьТекстСостоянияЭДНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НомераБилетов = Объект.БланкиБилетов.Выгрузить(,"Номер");
	НомераБилетов.Сортировать("Номер Возр");
	
	//Если НомераБилетов.Количество() <> 0 Тогда 
	//	
	//	ТекущийОбъект.СтрокаДляПечати = ЛБ_УправлениеЛомбардом.СформироватьСтрокуДляПечатиНомеровБилетов(НомераБилетов, Префикс);
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	//УстановитьТекстСостоянияЭДНаСервере();
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгененрироватьНомера(Команда)
	
	Если ДанныеКорректны() Тогда
		
		Если ПустаяСтрока(СимволДополнения) Тогда
			
			СимволДополнения = "0";
			
		КонецЕсли;

		Для Сч = НачальныйНомер По КонечныйНомер Цикл
			
			НомерБланка = СгенерироватьНомерБланка(Сч);
			
			ДобавитьСтрокуСНомером(НомерБланка);
						
			ОбработкаПрерыванияПользователя();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	// Вставить содержимое обработчика.
	Объект.БланкиБилетов.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" полей настройки генерации номеров.
//
Процедура НастройкаПриИзменении(Элемент)

	УстановитьВидимость();
	
КонецПроцедуры // НастройкаПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекстСостоянияЭДНаСервере()
	
	// ++ Сербаев 12.05.2023
	//ТекстСостоянияЭД = ОбменСКонтрагентамиКлиентСервер.ПолучитьТекстСостоянияЭД(Объект.Ссылка, Ложь);
	// -- Сербаев 12.05.2023
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСНомером(Номер)
		
	Отбор = новый Структура("Номер",Номер);
	Массив = Объект.БланкиБилетов.НайтиСтроки(Отбор);
	Если Массив.Количество() =  0 тогда
		
		 НоваяСтрока = Объект.БланкиБилетов.Добавить();
		 НоваяСтрока.Номер = Номер;
		 НоваяСтрока.Количество = 1;
		 
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Функция СгенерироватьНомерБланка(Сч)

	НомерБланка = Префикс;

	СтрокаНомер = Формат(Сч, "ЧГ=0");
	
	Если НЕ ЗначениеЗаполнено(ДлинаНомера) Тогда
		
		НомерБланка = НомерБланка + СтрокаНомер;
		
	Иначе
		
		НомерБланка = НомерБланка + ДополнитьСтроку(СтрокаНомер, ДлинаНомера - СтрДлина(Префикс), СимволДополнения);
		
	КонецЕсли;


	Возврат НомерБланка;

КонецФункции

&НаКлиенте
Функция ДополнитьСтроку(Знач Стр, Длина, Чем=" ", Режим = 0) Экспорт
	
	СимволовДополнить = Длина -  СтрДлина(Стр);
	Добавок = "";
	Для Н=1 по СимволовДополнить Цикл
		Добавок =	Добавок + Чем;
	КонецЦикла;
	Возврат ?(Режим=0, Добавок + Стр, Стр + Добавок);
	
КонецФункции 

&НаКлиенте
Функция ДанныеКорректны(ВыводитьСообщения = Истина)
	
	Отказ = Ложь;

	Если НЕ ЗначениеЗаполнено(НачальныйНомер) Тогда
		
		Если ВыводитьСообщения Тогда
			
			Сообщить("Не указан начальный номер!");
			
		КонецЕсли;
		
		Отказ = Истина;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КонечныйНомер) Тогда
		
		Если ВыводитьСообщения Тогда
			Сообщить("Не указан конечный номер!");
			
		КонецЕсли;
		
		Отказ = Истина;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(НачальныйНомер)
		И ЗначениеЗаполнено(КонечныйНомер) Тогда

		Если НачальныйНомер > КонечныйНомер Тогда
			
			Если ВыводитьСообщения Тогда
				
				Сообщить("Начальный номер не может быть больше конечного!");
				
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЕсли;

		Если ЗначениеЗаполнено(ДлинаНомера) Тогда
			
			Если Цел(Log10(КонечныйНомер)) + 1 > ДлинаНомера Тогда
				
				Если ВыводитьСообщения Тогда
					
					Сообщить("Длина конечного номера больше, чем параметр ""Длина номера""!");
					
				КонецЕсли;
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

	СуммДлинаНомера = СтрДлина(Префикс) + СтрДлина(Формат(КонечныйНомер, "ЧГ=0"));
	
	Если СуммДлинаНомера > ДлинаНомера Тогда
		
		Если ВыводитьСообщения Тогда
			
			Сообщить("Суммарная длина номера (" + СуммДлинаНомера + ") больше допустимой (" + ДлинаНомера + ")!");
			
		КонецЕсли;
		
		Отказ = Истина;
		
	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции // ДанныеКорректны()

&НаКлиенте
// Управляет видимостью элементов формы.
//
Процедура УстановитьВидимость()

	Если ДанныеКорректны(Ложь) Тогда
		
		КоличествоБилетов = КонечныйНомер - НачальныйНомер + 1;
		Пример            = СгенерироватьНомерБланка(Цел((НачальныйНомер + КонечныйНомер) / 2));
		
	Иначе
		
		КоличествоБилетов = 0;
		Пример            = "";
		
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ВидПриИзмененииНаСервере()
	
	Если Объект.ВидОперации = Перечисления.ЮС_ВидыОперацийОприходованиеБланков.Залог Тогда
		ЭтаФорма.Заголовок = "Оприходование бланков. Залог";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
